In [15]:
#Determinante
import sympy as sp

M = sp.Matrix([[1, 2, 3], [2, 4, 6], [3, 6, 9]])
det_M = sp.det(M)

print(det_M)

0

In [6]:
#Determinante
import sympy as sp

M = sp.Matrix([[4, 7, 0], [0, 0, 6], [1, 0, 6]])
det_M = sp.det(M)

print(det_M)

42

In [2]:
#Invertir Matriz
import sympy as sp

MN = sp.Matrix([[4, 7, 0], [0, 0, 6], [1, 0, 6]])
inv_M = M.inv()

print(inv_M)

Matrix([[0, -1, 1], [1/7, 4/7, -4/7], [0, 1/6, 0]])

In [16]:
#Traza
import sympy as sp

M = sp.Matrix([[-14, 5, 2], [4, -3, -22], [-14, 3, -7]])
traza_M = sp.trace(M)

print(traza_M)

-24

In [53]:

import pandas as pd

data = {'A':[28, 18, 41, 41,
         15, 17, 19, 32,
         18, 15, 29, 23,
         44, 43, 20, 44]}


df = pd.DataFrame(data)
df.describe()

              A
count  16.00000
mean   27.93750
std    11.31647
min    15.00000
25%    18.00000
50%    25.50000
75%    41.00000
max    44.00000

In [13]:
df.sort_values('A', ascending=False)

     A
12  44
15  44
13  43
2   41
3   41
7   32
10  29
0   28
11  23
14  20
6   19
1   18
8   18
5   17
4   15
9   15

In [25]:
df.describe()

              A
count  16.00000
mean   27.93750
std    11.31647
min    15.00000
25%    18.00000
50%    25.50000
75%    41.00000
max    44.00000

In [23]:
df.var()

A    128.0625
dtype: float64

In [40]:
#  Valor
data = { 'datos': [44, 43, 43, 44, 44, 43,
                   44, 44, 60, 43, 42, 44,
                   50, 42, 43, 42, 42]}

df1 = pd.DataFrame(data)

In [41]:
df1.describe()

           datos
count  17.000000
mean   44.529412
std     4.389158
min    42.000000
25%    43.000000
50%    43.000000
75%    44.000000
max    60.000000

In [33]:
df1.var()

datos    19.264706
dtype: float64

In [51]:
df1.median()

datos    43.0
dtype: float64

In [50]:
df1.mode()

   datos
0     44

In [38]:
#  Valor
data = { 'datos': [44, 43, 43, 44, 44, 43,
                   44, 44, 43, 42, 44,
                   42, 43, 42, 42]}

df2 = pd.DataFrame(data)
df2.describe()

           datos
count  15.000000
mean   43.133333
std     0.833809
min    42.000000
25%    42.500000
50%    43.000000
75%    44.000000
max    44.000000

In [39]:
df2.var()

datos    0.695238
dtype: float64

In [47]:
import numpy as np
datos_mediana = [ 6, 5, 7, 7, 5, 7]
np.median(datos_mediana)

6.5

In [52]:
import numpy as np
datos_mediana = [ 6, 5, 7, 7, 5, 7]
np.mean(datos_mediana)

6.166666666666667